Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 30)                23550     
                                                                 
 dense_1 (Dense)             (None, 10)                310       
                                                                 
 dense_2 (Dense)             (None, 10)                110       
                                                                 
=================================================================
Total params: 23970 (93.63 KB)
Trainable params: 23970 (93.63 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________