Model: "sequential_3"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten_3 (Flatten)         (None, 784)               0         
                                                                 
 dense_9 (Dense)             (None, 100)               78500     
                                                                 
 dense_10 (Dense)            (None, 30)                3030      
                                                                 
 dense_11 (Dense)            (None, 10)                310       
                                                                 
 dense_12 (Dense)            (None, 10)                110       
                                                                 
=================================================================
Total params: 81950 (320.12 KB)
Trainable params: 81950 (320.12 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________