Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten_1 (Flatten)         (None, 784)               0         
                                                                 
 dense_3 (Dense)             (None, 30)                23550     
                                                                 
 dense_4 (Dense)             (None, 10)                310       
                                                                 
 dense_5 (Dense)             (None, 10)                110       
                                                                 
=================================================================
Total params: 23970 (93.63 KB)
Trainable params: 23970 (93.63 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________